# โปรแกรมคำนวณค่า BMI (ดัชนีมวลกาย)
# BMI =  น้ำหนัก (kg) / ส่วนสูง * ส่วนสูง (m)

#input
weight = int(input("ป้อนน้ำหนักของคุณ (kg) : "))
hight = int(input("ป้อนส่วนสูงของคุณ (cm) : "))

#process
BMI = weight/((hight/100)**2)

#output
print("Your BMI : ",BMI)

'''
<18 ต่ำกว่าเกณฑ์
18.5 - 22.9 = สมส่วน
23.0 - 24.9 = น้ำหนักเกิน
25.0 - 29.9 = โรคอ้วน ระดับที่ 1
>30 = โรคอ้วนระดับอันตราย
'''

if BMI>=0 and BMI<18.0:
    print("ต่ำกว่าเกณฑ์")
elif BMI>=18.5 and BMI<=22.9:
    print("สมส่วน")
elif BMI>=23.0 and BMI<=24.9:
    print("น้ำหนักเกิน")
elif BMI>=25.0 and BMI<=29.9:
    print("โรคอ้วน ระดับที่ 1")
else:
    print("โรคอ้วนระดับอันตราย")

# Note: คำสั่ง pass เป็นการข้ามการทำงานในเงื่อนไขนั้นๆ